#### BuiltInFailures.CutFailures Members

---

|  |
| --- |
| BuiltInFailures CutFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures CutFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCutGeometry | Elements do not intersect. |
| Public property Static member | CannotCutGeometryWarn | Elements do not intersect. |
| Public property Static member | CannotCutInstanceOut | Can't cut instance of [Symbol] out of Wall. |
| Public property Static member | CannotCutInstanceOutError | Can't cut instance of [Symbol] out of Wall. |
| Public property Static member | CannotCutInstanceOutGen | Can't cut instance(s) of [Symbol] out of its host. |
| Public property Static member | CannotCutInstanceOutGenError | Can't cut instance(s) of [Symbol] out of its host. |
| Public property Static member | CannotCutInstanceOutGenWarn | Can't cut instance(s) of [Symbol] out of its host. |
| Public property Static member | CannotCutInstanceOutWarn | Can't cut instance of [Symbol] out of Wall. |
| Public property Static member | CannotCutJoinedElement | Can't cut joined element. |
| Public property Static member | CannotCutRoof | The roof couldn't be cut. |
| Public property Static member | CannotCutRoofError | The roof couldn't be cut. |
| Public property Static member | CantCutHostWithInstance | Can't cut host with instance. |
| Public property Static member | CutExactlyHalf | Can't cut in half. Move plane towards either end. |
| Public property Static member | CutoutNotCuttingAnything | Opening not cutting anything. |
| Public property Static member | CutoutNotCuttingAnythingDeleteOpening | Opening not cutting anything. |
| Public property Static member | DormerCutProblem | Dormer Opening Cut is not fully defined. Cut was not performed. |
| Public property Static member | DormerCutProblemWarn | Dormer Opening Cut is not fully defined. Cut was not performed. |
| Public property Static member | HostCutoutForInsertionFailure | Can't cut host for inserted objects |
| Public property Static member | InstanceNotCuttingAnything | Instance(s) of [Symbol] not cutting anything. |

# See Also

BuiltInFailures CutFailures Class

Autodesk.Revit.DB Namespace